// data/tamilNames.ts
export const tamilNames = [
  "முத்து", "சதீஷ்", "கார்த்தி", "முருகன்", "சரவணன்",
  "பிரபு", "செந்தில்", "அருள்", "தினேஷ்", "விக்னேஷ்",
  "சுரேஷ்", "ரமேஷ்", "கண்ணன்", "மணி", "குமார்",
  "ராஜா", "செல்வம்", "கோபி", "நவீன்", "பரத்",
  "ஆதவன்", "ஆகash", "ஆலன்", "ஆத்மிகா", "ஆதித்யா",
  "அஜித்", "அழகிரி", "அலங்கார்", "அமர்நாத்", "ஆனந்த்",
  "அன்பு", "அன்புச்செல்வன்", "ஆண்டவர்", "அரவிந்த்", "அருண்",
  "அசோக்", "பாலாஜி", "பாலசுப்பிரமணியன்", "பாஸ்கர்", "சந்துரு",
  "சரண்", "தனுஷ்", "ஈஸ்வர்", "கௌதம்", "கோபால்",
  "ஹரிஷ்", "இளங்கோ", "ஜெயராஜ்", "ஜீவன்", "கவின்",
  "லக்ஷ்மணன்", "மாதவன்", "மகேஷ்", "மாணிக்கம்", "மாரிமுத்து",
  "மோகன்", "நாகராஜன்", "நாகராஜ்", "நந்தன்", "நாராயணன்",
  "நிதின்", "பழனிவேல்", "பார்த்திபன்", "பிரகாஷ்", "ராகவன்",
  "ரஞ்சித்", "ரவி", "ரவிச்சந்திரன்", "சாய்ராம்", "சஞ்சய்",
  "செல்வன்", "சித்தார்த்", "சிவகுமார்", "சுந்தர்", "சுவாமிநாதன்",
  "தங்கராஜ்", "திருமால்", "உதய்", "உமேஷ்", "வசந்த்",
  "வெங்கடேஷ்", "விஜய்", "விநய்", "விவேக்", "யாஷ்",
  "யோகேஷ்", "ஜாகிர்", "கார்த்திக்", "ரத்தினம்", "சக்தி",
  "சிதம்பரம்", "மீனாட்சி", "சுந்தரம்", "சின்னசாமி", "பெரியசாமி",
  "முத்தமிழ்", "செந்தமிழ்", "இளங்கோ", "நெடுஞ்செழியன்", "ராஜேந்திரன்"
] as const;

export type TamilName = typeof tamilNames[number];
